vitalyruhl/esp32-bacnet-stack/examples/hil-cov-espClient-to-espServer-acceptance/src/main.cpp
bool hasExpectedPresentValueType(BacnetObjectType type, const BacnetValue& value) {
  if (bacnetIsAnalogProcessObject(type)) {
    return value.type == BacnetValueType::Real;
  }
  if (bacnetIsBinaryProcessObject(type)) {
    return value.type == BacnetValueType::Enumerated;
  }
  if (bacnetIsMultiStateProcessObject(type)) {
    return value.type == BacnetValueType::Unsigned ||
           value.type == BacnetValueType::Enumerated;
  }
  return false;
}

const char* expectedPresentValueTypeText(BacnetObjectType type) {
  if (bacnetIsAnalogProcessObject(type)) {
    return "real";
  }
  if (bacnetIsBinaryProcessObject(type)) {
    return "enumerated";
  }
  if (bacnetIsMultiStateProcessObject(type)) {
    return "unsigned-or-enumerated";
  }
  return "unknown";
}

void printS02ObjectLine(ScenarioOutcome outcome, const S02TargetSpec& target, BacnetDeviceSessionReadStatus status, const BacnetValue* value, bool expectedTypeOk, bool configured) {
  Serial.print("[");
  Serial.print(scenarioOutcomeText(outcome));
  Serial.print("] S02 ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(bacnetObjectTypeText(target.type));
  Serial.print("(type=");
  Serial.print(static_cast<unsigned>(static_cast<uint16_t>(target.type)));
  Serial.print(")");
  Serial.print(",");
  Serial.print(target.instance);
  Serial.print(" property=present-value read-status=");
  Serial.print(bacnetReadStatusText(status));

  if (!configured) {
    Serial.print(" not-configured");
  } else if (status == BacnetDeviceSessionReadStatus::Ack && value != nullptr) {
    Serial.print(" value=");
    Serial.print(value->displayText());
    Serial.print(" type=");
    Serial.print(bacnetValueTypeName(value->type));
    if (!expectedTypeOk) {
      Serial.print(" expected=");
      Serial.print(expectedPresentValueTypeText(target.type));
    }
  }
  Serial.println();
}

WiFiUDP bacnetUdp;
ArduinoUdpDatagramTransport bacnetTransport(bacnetUdp);
ArduinoMonotonicClock bacnetClock;
BacnetClient client(bacnetTransport, &bacnetClock);
BacnetScannedObject scanResults[kMaxScanResults];
BacnetObjectListScanJob scanJob;
bool completed = false;
bool runtimeReady = false;
IPAddress targetAddress;

bool parseIp(const char* text, IPAddress& address) {
  return text != nullptr && address.fromString(text);
}

bool connectNetwork() {
#if EXAMPLE_USE_ETHERNET
  const bacnet_example::EthernetConfig config{
    MY_USE_DHCP,
    MY_ETHERNET_IP,
    MY_GATEWAY_IP,
    MY_SUBNET_MASK,
    MY_DNS_IP,
  };
  if (!bacnet_example::EthernetNetwork::begin("bacnet-hil-cov", config) ||
      !bacnet_example::EthernetNetwork::waitForIp(kNetworkConnectTimeoutMs)) {
    printResult("FAIL", "Ethernet connection failed");
    return false;
  }
  Serial.print("[HIL] Ethernet IP=");
  Serial.println(bacnet_example::EthernetNetwork::localIp());
  printResult("PASS", "Ethernet connected");
  return true;
#else
  const bacnet_example::WiFiNetworkConfig config{
    MY_USE_DHCP, MY_WIFI_SSID, MY_WIFI_PASSWORD, MY_WIFI_IP, MY_GATEWAY_IP, MY_SUBNET_MASK, MY_DNS_IP, kNetworkConnectTimeoutMs, kNetworkRetryDelayMs, false};
  if (!bacnet_example::Esp32WiFiNetwork::begin(config)) {
    printResult("FAIL", "WiFi connection failed");
    return false;
  }
  printResult("PASS", "WiFi connected");
  return true;
#endif
}

bool ensureRuntimeReady() {
  if (runtimeReady) {
    return true;
  }
  if (!connectNetwork()) {
    return false;
  }
  if (!client.begin()) {
    printResult("FAIL", "BACnet client begin failed");
    return false;
  }
  if (!parseIp(BACNET_TARGET_ADDRESS, targetAddress)) {
    printResult("FAIL", "invalid BACnet target address");
    return false;
  }

  Serial.print("[HIL] target=");
  Serial.print(BACNET_TARGET_ADDRESS);
  Serial.print(":");
  Serial.print(BACNET_TARGET_PORT);
  Serial.print(" device-instance=");
  Serial.println(BACNET_TARGET_DEVICE_INSTANCE);

  runtimeReady = true;
  return true;
}

bool hasSafeReadStatus(BacnetDeviceSessionReadStatus status) {
  return status == BacnetDeviceSessionReadStatus::Ack ||
         status == BacnetDeviceSessionReadStatus::Error ||
         status == BacnetDeviceSessionReadStatus::Timeout ||
         status == BacnetDeviceSessionReadStatus::SendFailed ||
         status == BacnetDeviceSessionReadStatus::Skipped;
}

bool hasSafePropertyReadStatus(BacnetPropertyReadStatus status) {
  switch (status) {
    case BacnetPropertyReadStatus::Ack:
    case BacnetPropertyReadStatus::UnsupportedProperty:
    case BacnetPropertyReadStatus::Timeout:
    case BacnetPropertyReadStatus::Error:
    case BacnetPropertyReadStatus::Reject:
    case BacnetPropertyReadStatus::Abort:
    case BacnetPropertyReadStatus::DecodeError:
    case BacnetPropertyReadStatus::EmptyValue:
    case BacnetPropertyReadStatus::UnsupportedDatatype:
    case BacnetPropertyReadStatus::ArrayIndexNotSupported:
    case BacnetPropertyReadStatus::SendFailed:
      return true;
    case BacnetPropertyReadStatus::Busy:
    case BacnetPropertyReadStatus::Skipped:
      return false;
  }

  return false;
}

bool objectFound(BacnetObjectType type, uint32_t instance, const BacnetObjectScanResult& summary) {
  const uint16_t rawType = static_cast<uint16_t>(type);
  for (size_t i = 0; i < summary.stored; ++i) {
    if (scanResults[i].objectId.type == rawType &&
        scanResults[i].objectId.instance == instance) {
      return true;
    }
  }
  return false;
}

void printSummary(const BacnetObjectScanResult& summary) {
  Serial.print("[HIL] terminal=");
  Serial.print(bacnetObjectListScanJobStatusText(scanJob.status()));
  Serial.print(" phase=");
  Serial.print(bacnetObjectListScanPhaseText(scanJob.phase()));
  Serial.print(" inspected=");
  Serial.print(summary.inspected);
  Serial.print(" found=");
  Serial.print(summary.found);
  Serial.print(" stored=");
  Serial.print(summary.stored);
  Serial.print(" truncated=");
  Serial.println(summary.truncated ? "yes" : "no");
}

bool validateOptionalPropertyStatuses(const BacnetObjectScanResult& summary) {
  for (size_t i = 0; i < summary.stored; ++i) {
    if (!hasSafeReadStatus(scanResults[i].objectNameStatus) ||
        !hasSafeReadStatus(scanResults[i].descriptionStatus) ||
        !hasSafeReadStatus(scanResults[i].presentValueStatus)) {
      return false;
    }
  }
  return true;
}

ScenarioOutcome runNonBlockingObjectListScanScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  BacnetDeviceSession device(client, BACNET_TARGET_DEVICE_INSTANCE, bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  const BacnetObjectType valueTypes[] = {
    BacnetObjectType::AnalogInput,
    BacnetObjectType::AnalogOutput,
    BacnetObjectType::AnalogValue,
    BacnetObjectType::BinaryInput,
    BacnetObjectType::BinaryOutput,
    BacnetObjectType::BinaryValue,
    BacnetObjectType::MultiStateInput,
    BacnetObjectType::MultiStateOutput,
    BacnetObjectType::MultiStateValue,
  };

  BacnetObjectScanOptions options;
  bacnetSetObjectTypeFilter(options, valueTypes);
  options.maxObjectListEntries = kMaxObjectListEntries;
  options.readTimeoutMs = kScanReadTimeoutMs;
  options.readObjectName = true;
  options.readDescription = true;
  options.readPresentValue = true;

  if (!device.beginObjectListScan(scanJob, options, scanResults, kMaxScanResults)) {
    printResult("FAIL", "beginObjectListScan failed");
    return ScenarioOutcome::Fail;
  }

