vitalyruhl/esp32-bacnet-stack/examples/hil-cov-espClient-to-espServer-acceptance/src/main.cpp
  const uint32_t startedAt = millis();
  uint32_t lastIndex = scanJob.currentIndex();
  bool progressAdvanced = false;
  bool requestWasIdle = false;

  while (scanJob.isActive() && millis() - startedAt < kScanTimeoutMs) {
    device.pollObjectListScan(scanJob, millis());
    if (scanJob.currentIndex() != lastIndex) {
      progressAdvanced = true;
      lastIndex = scanJob.currentIndex();
    }
    if (!scanJob.requestInFlight()) {
      requestWasIdle = true;
    }
    delay(kPollDelayMs);
    yield();
  }

  const BacnetObjectScanResult& summary = scanJob.summary();
  printSummary(summary);

  const bool requireExpectedAv = BACNET_EXPECT_AV_INSTANCE != 0;
  const bool requireExpectedMv = BACNET_EXPECT_MV_INSTANCE != 0;
  const bool expectedAvFound =
    !requireExpectedAv ||
    objectFound(BacnetObjectType::AnalogValue, BACNET_EXPECT_AV_INSTANCE, summary);
  const bool expectedMvFound =
    !requireExpectedMv ||
    objectFound(BacnetObjectType::MultiStateValue, BACNET_EXPECT_MV_INSTANCE, summary);

  Serial.print("[HIL] expected-av=");
  Serial.print(requireExpectedAv ? (expectedAvFound ? "yes" : "no") : "skip");
  Serial.print(" expected-mv=");
  Serial.println(requireExpectedMv ? (expectedMvFound ? "yes" : "no") : "skip");

  const bool ok =
    !scanJob.isActive() &&
    scanJob.isComplete() &&
    !scanJob.isFailed() &&
    !scanJob.requestInFlight() &&
    progressAdvanced &&
    requestWasIdle &&
    summary.objectListCountStatus == BacnetDeviceSessionReadStatus::Ack &&
    summary.inspected > 0 &&
    summary.found > 0 &&
    summary.stored > 0 &&
    expectedAvFound &&
    expectedMvFound &&
    validateOptionalPropertyStatuses(summary);

  return ok ? ScenarioOutcome::Pass : ScenarioOutcome::Fail;
}

bool hasSafeObjectStatusSnapshot(const BacnetObjectStatus& status,
                                 bool required) {
  if (!hasSafePropertyReadStatus(status.presentValueStatus) ||
      !hasSafePropertyReadStatus(status.statusFlagsStatus) ||
      !hasSafePropertyReadStatus(status.eventStateStatus) ||
      !hasSafePropertyReadStatus(status.reliabilityStatus) ||
      !hasSafePropertyReadStatus(status.outOfServiceStatus)) {
    return false;
  }

  return !required || status.presentValueStatus == BacnetPropertyReadStatus::Ack;
}

void printStatusFlags(const BacnetObjectStatus& status) {
  Serial.print(" flags=");
  Serial.print(bacnetPropertyReadStatusText(status.statusFlagsStatus));
  if (status.statusFlagsStatus == BacnetPropertyReadStatus::Ack) {
    Serial.print("(");
    Serial.print(status.statusFlags.inAlarm ? "alarm" : "no-alarm");
    Serial.print(",");
    Serial.print(status.statusFlags.fault ? "fault" : "no-fault");
    Serial.print(",");
    Serial.print(status.statusFlags.overridden ? "overridden" : "normal");
    Serial.print(",");
    Serial.print(status.statusFlags.outOfService ? "oos" : "in-service");
    Serial.print(")");
  }
}

void printStatusSnapshotLine(ScenarioOutcome outcome,
                             const S02TargetSpec& target,
                             const BacnetObjectStatus& status,
                             bool configured) {
  Serial.print("[");
  Serial.print(scenarioOutcomeText(outcome));
  Serial.print("] S03 ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(bacnetObjectTypeText(target.type));
  Serial.print("(type=");
  Serial.print(static_cast<unsigned>(static_cast<uint16_t>(target.type)));
  Serial.print(")");
  Serial.print(",");
  Serial.print(target.instance);
  if (!configured) {
    Serial.println(" not-configured");
    return;
  }

  Serial.print(" state=");
  Serial.print(bacnetObjectHealthStateText(status.state));
  Serial.print(" pv-status=");
  Serial.print(bacnetPropertyReadStatusText(status.presentValueStatus));
  if (status.presentValueStatus == BacnetPropertyReadStatus::Ack) {
    Serial.print(" pv=");
    Serial.print(status.presentValue.displayText());
  }
  printStatusFlags(status);
  Serial.print(" event-state=");
  Serial.print(bacnetPropertyReadStatusText(status.eventStateStatus));
  if (status.eventStateStatus == BacnetPropertyReadStatus::Ack) {
    Serial.print("(");
    Serial.print(bacnetEventStateText(status.eventState));
    Serial.print(")");
  }
  Serial.print(" reliability=");
  Serial.print(bacnetPropertyReadStatusText(status.reliabilityStatus));
  if (status.reliabilityStatus == BacnetPropertyReadStatus::Ack) {
    Serial.print("(");
    Serial.print(bacnetReliabilityText(status.reliability));
    Serial.print(")");
  }
  Serial.print(" oos=");
  Serial.print(bacnetPropertyReadStatusText(status.outOfServiceStatus));
  if (status.outOfServiceStatus == BacnetPropertyReadStatus::Ack) {
    Serial.print("(");
    Serial.print(status.outOfService ? "true" : "false");
    Serial.print(")");
  }
  Serial.println();
}

ScenarioOutcome runCommonProcessPresentValueReadScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  BacnetDeviceSession device(client, BACNET_TARGET_DEVICE_INSTANCE, bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  const S02TargetSpec targets[] = {
    {"AI100", BacnetObjectType::AnalogInput, HIL_AI100_ANALOG_INPUT, HIL_REQUIRE_AI100},
    {"AI101", BacnetObjectType::AnalogInput, HIL_AI101_ANALOG_INPUT, HIL_REQUIRE_AI101},
    {"AO110", BacnetObjectType::AnalogOutput, HIL_AO110_ANALOG_OUTPUT, HIL_REQUIRE_AO110},
    {"AO111", BacnetObjectType::AnalogOutput, HIL_AO111_ANALOG_OUTPUT, HIL_REQUIRE_AO111},
    {"AV220", BacnetObjectType::AnalogValue, HIL_AV220_ANALOG_VALUE, HIL_REQUIRE_AV220},
    {"AV221", BacnetObjectType::AnalogValue, HIL_AV221_ANALOG_VALUE, HIL_REQUIRE_AV221},
    {"BI300", BacnetObjectType::BinaryInput, HIL_BI300_BINARY_INPUT, HIL_REQUIRE_BI300},
    {"BI301", BacnetObjectType::BinaryInput, HIL_BI301_BINARY_INPUT, HIL_REQUIRE_BI301},
    {"BO310", BacnetObjectType::BinaryOutput, HIL_BO310_BINARY_OUTPUT, HIL_REQUIRE_BO310},
    {"BO311", BacnetObjectType::BinaryOutput, HIL_BO311_BINARY_OUTPUT, HIL_REQUIRE_BO311},
    {"BV320", BacnetObjectType::BinaryValue, HIL_BV320_BINARY_VALUE, HIL_REQUIRE_BV320},
    {"BV321", BacnetObjectType::BinaryValue, HIL_BV321_BINARY_VALUE, HIL_REQUIRE_BV321},
    {"MI400", BacnetObjectType::MultiStateInput, HIL_MI400_MULTISTATE_INPUT, HIL_REQUIRE_MI400},
    {"MI401", BacnetObjectType::MultiStateInput, HIL_MI401_MULTISTATE_INPUT, HIL_REQUIRE_MI401},
    {"MO410", BacnetObjectType::MultiStateOutput, HIL_MO410_MULTISTATE_OUTPUT, HIL_REQUIRE_MO410},
    {"MO411", BacnetObjectType::MultiStateOutput, HIL_MO411_MULTISTATE_OUTPUT, HIL_REQUIRE_MO411},
    {"MV2020", BacnetObjectType::MultiStateValue, HIL_MV2020_MULTISTATE_VALUE, HIL_REQUIRE_MV2020},
    {"MV2021", BacnetObjectType::MultiStateValue, HIL_MV2021_MULTISTATE_VALUE, HIL_REQUIRE_MV2021},
  };

  size_t configuredTargets = 0;
  size_t passedTargets = 0;
  size_t skippedTargets = 0;
  size_t optionalFailures = 0;
  size_t requiredFailures = 0;

  for (const S02TargetSpec& target : targets) {
    if (target.instance == 0) {
      ++skippedTargets;
      printS02ObjectLine(ScenarioOutcome::Skip, target, BacnetDeviceSessionReadStatus::Skipped, nullptr, false, false);
      continue;
    }

    ++configuredTargets;
    BacnetValue value;
    const BacnetDeviceSessionReadStatus status =
      device.object(target.type, target.instance)
        .readPresentValue(value, kScanReadTimeoutMs);
    const bool targetOk = status == BacnetDeviceSessionReadStatus::Ack &&
                          hasExpectedPresentValueType(target.type, value);
    printS02ObjectLine(targetOk ? ScenarioOutcome::Pass : ScenarioOutcome::Fail,
                       target,
                       status,
                       &value,
                       targetOk,
                       true);

    if (targetOk) {
      ++passedTargets;
    } else if (target.required) {
      ++requiredFailures;
    } else {
      ++optionalFailures;
    }
  }

  Serial.print("[HIL] S02 configured=");
  Serial.print(configuredTargets);
  Serial.print(" passed=");
  Serial.print(passedTargets);
  Serial.print(" optional-failures=");
  Serial.print(optionalFailures);
  Serial.print(" required-failures=");
  Serial.print(requiredFailures);
  Serial.print(" skipped=");
  Serial.println(skippedTargets);

  if (configuredTargets == 0) {
    printResult("I", "S02 target objects not configured");
    return ScenarioOutcome::Skip;
  }

  return (passedTargets > 0 && requiredFailures == 0)
           ? ScenarioOutcome::Pass
           : ScenarioOutcome::Fail;
}

