vitalyruhl/esp32-bacnet-stack/examples/hil-cov-espClient-to-espServer-acceptance/src/main.cpp
ScenarioOutcome runCommonProcessStatusReadScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  BacnetDeviceSession device(client, BACNET_TARGET_DEVICE_INSTANCE, bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  const S02TargetSpec targets[] = {
    {"AI100", BacnetObjectType::AnalogInput, HIL_AI100_ANALOG_INPUT, HIL_REQUIRE_AI100},
    {"AI101", BacnetObjectType::AnalogInput, HIL_AI101_ANALOG_INPUT, HIL_REQUIRE_AI101},
    {"AO110", BacnetObjectType::AnalogOutput, HIL_AO110_ANALOG_OUTPUT, HIL_REQUIRE_AO110},
    {"AO111", BacnetObjectType::AnalogOutput, HIL_AO111_ANALOG_OUTPUT, HIL_REQUIRE_AO111},
    {"AV220", BacnetObjectType::AnalogValue, HIL_AV220_ANALOG_VALUE, HIL_REQUIRE_AV220},
    {"AV221", BacnetObjectType::AnalogValue, HIL_AV221_ANALOG_VALUE, HIL_REQUIRE_AV221},
    {"BI300", BacnetObjectType::BinaryInput, HIL_BI300_BINARY_INPUT, HIL_REQUIRE_BI300},
    {"BI301", BacnetObjectType::BinaryInput, HIL_BI301_BINARY_INPUT, HIL_REQUIRE_BI301},
    {"BO310", BacnetObjectType::BinaryOutput, HIL_BO310_BINARY_OUTPUT, HIL_REQUIRE_BO310},
    {"BO311", BacnetObjectType::BinaryOutput, HIL_BO311_BINARY_OUTPUT, HIL_REQUIRE_BO311},
    {"BV320", BacnetObjectType::BinaryValue, HIL_BV320_BINARY_VALUE, HIL_REQUIRE_BV320},
    {"BV321", BacnetObjectType::BinaryValue, HIL_BV321_BINARY_VALUE, HIL_REQUIRE_BV321},
    {"MI400", BacnetObjectType::MultiStateInput, HIL_MI400_MULTISTATE_INPUT, HIL_REQUIRE_MI400},
    {"MI401", BacnetObjectType::MultiStateInput, HIL_MI401_MULTISTATE_INPUT, HIL_REQUIRE_MI401},
    {"MO410", BacnetObjectType::MultiStateOutput, HIL_MO410_MULTISTATE_OUTPUT, HIL_REQUIRE_MO410},
    {"MO411", BacnetObjectType::MultiStateOutput, HIL_MO411_MULTISTATE_OUTPUT, HIL_REQUIRE_MO411},
    {"MV2020", BacnetObjectType::MultiStateValue, HIL_MV2020_MULTISTATE_VALUE, HIL_REQUIRE_MV2020},
    {"MV2021", BacnetObjectType::MultiStateValue, HIL_MV2021_MULTISTATE_VALUE, HIL_REQUIRE_MV2021},
  };

  size_t configuredTargets = 0;
  size_t passedTargets = 0;
  size_t skippedTargets = 0;
  size_t optionalFailures = 0;
  size_t requiredFailures = 0;

  for (const S02TargetSpec& target : targets) {
    if (target.instance == 0) {
      ++skippedTargets;
      BacnetObjectStatus skippedStatus;
      printStatusSnapshotLine(ScenarioOutcome::Skip, target, skippedStatus, false);
      continue;
    }

    ++configuredTargets;
    BacnetObjectStatus status;
    device.readObjectStatus(target.type, target.instance, status, kScanReadTimeoutMs, target.required);
    const bool targetOk = hasSafeObjectStatusSnapshot(status, target.required);
    printStatusSnapshotLine(targetOk ? ScenarioOutcome::Pass
                                     : ScenarioOutcome::Fail,
                            target,
                            status,
                            true);

    if (targetOk) {
      ++passedTargets;
    } else if (target.required) {
      ++requiredFailures;
    } else {
      ++optionalFailures;
    }
  }

  Serial.print("[HIL] S03 configured=");
  Serial.print(configuredTargets);
  Serial.print(" passed=");
  Serial.print(passedTargets);
  Serial.print(" optional-failures=");
  Serial.print(optionalFailures);
  Serial.print(" required-failures=");
  Serial.print(requiredFailures);
  Serial.print(" skipped=");
  Serial.println(skippedTargets);

  if (configuredTargets == 0) {
    printResult("I", "S03 target objects not configured");
    return ScenarioOutcome::Skip;
  }

  return (passedTargets > 0 && requiredFailures == 0)
           ? ScenarioOutcome::Pass
           : ScenarioOutcome::Fail;
}

ScenarioOutcome runPropertyCacheScenario() {
  printResult("I", "property cache scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runSubscribeAnyPropertyScenario() {
  printResult("I", "subscribe-any-property scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runFallbackPollingValueChangeScenario() {
  printResult("I", "fallback polling value-change scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runSubscribeCovScenario() {
#if !HIL_IO_SERVER_COV_MODE
  printResult("I", "SubscribeCOV scenario requires a target-specific HIL profile");
  return ScenarioOutcome::Fail;
#else
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  const BacnetIpEndpoint target =
    bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT);
  const auto logSubscription = [](const char* step,
                                  uint32_t processId,
                                  BacnetObjectId object,
                                  const char* kind,
                                  bool confirmed,
                                  uint8_t invokeId) {
    Serial.print("[HIL] COV step=");
    Serial.print(step);
    Serial.print(" process=");
    Serial.print(processId);
    Serial.print(" object-type=");
    Serial.print(object.type);
    Serial.print(" instance=");
    Serial.print(object.instance);
    Serial.print(" subscription=");
    Serial.print(kind);
    Serial.print(" confirmed=");
    Serial.print(confirmed ? "yes" : "no");
    Serial.print(" invoke=");
    Serial.println(invokeId);
  };
  const auto waitForSubscriptionResponse = [](bool propertySubscription,
                                              uint8_t invokeId) {
    const uint32_t deadline = millis() + kCovResponseTimeoutMs;
    while (static_cast<int32_t>(millis() - deadline) < 0) {
      const BacnetSubscribeCovResponseKind response = propertySubscription
                                                        ? client.pollSubscribeCovProperty(invokeId)
                                                        : client.pollSubscribeCov(invokeId);
      if (response == BacnetSubscribeCovResponseKind::Ack) {
        Serial.print("[HIL] COV subscription ACK invoke=");
        Serial.println(invokeId);
        return true;
      }
      if (response == BacnetSubscribeCovResponseKind::Error ||
          response == BacnetSubscribeCovResponseKind::Reject ||
          response == BacnetSubscribeCovResponseKind::Abort) {
        Serial.print("[HIL] COV subscription response failure kind=");
        Serial.print(static_cast<uint8_t>(response));
        Serial.print(" invoke=");
        Serial.println(invokeId);
        return false;
      }
      client.idle();
      delay(kPollDelayMs);
    }
    Serial.print("[HIL] COV subscription response timeout invoke=");
    Serial.println(invokeId);
    return false;
  };
  const auto hasProperty = [](const BacnetCovNotification& notification,
                              BacnetPropertyId property) {
    for (size_t index = 0; index < notification.propertyCount; ++index) {
      if (notification.properties[index].property == property) {
        return true;
      }
    }
    return false;
  };
  const auto waitForNotification = [](uint32_t timeoutMs,
                                      BacnetCovNotification& notification) {
    const uint32_t deadline = millis() + timeoutMs;
    while (static_cast<int32_t>(millis() - deadline) < 0) {
      if (client.pollCovNotification(notification)) {
        return true;
      }
      client.idle();
      delay(kPollDelayMs);
    }
    Serial.println("[HIL] COV notification timeout");
    return false;
  };
  const auto cancelObject = [&](uint32_t processId,
                                BacnetObjectId object,
                                bool confirmed,
                                uint8_t invokeId) {
    return client.sendSubscribeCov(target, processId, object, 0, invokeId, confirmed) &&
           waitForSubscriptionResponse(false, invokeId);
  };
  const auto cancelProperty = [&](uint32_t processId,
                                  BacnetObjectId object,
                                  BacnetPropertyId property,
                                  uint8_t invokeId) {
    return client.sendSubscribeCovProperty(target, processId, object, property, 0, invokeId) &&
           waitForSubscriptionResponse(true, invokeId);
  };

  const BacnetObjectId setButton{static_cast<uint16_t>(BacnetObjectType::BinaryInput), 2};
  const BacnetObjectId midButton{static_cast<uint16_t>(BacnetObjectType::BinaryInput), 1};
  const BacnetObjectId resetButton{static_cast<uint16_t>(BacnetObjectType::BinaryInput), 0};
  const BacnetObjectId lightSensor{static_cast<uint16_t>(BacnetObjectType::AnalogInput), 0};
  BacnetCovNotification notification;

  constexpr uint32_t kSetProcessId = 0xE202U;
  logSubscription("A", kSetProcessId, setButton, "object", false, 21);
  if (!client.sendSubscribeCov(target, kSetProcessId, setButton, 30, 21, false) ||
      !waitForSubscriptionResponse(false, 21) ||
      !waitForNotification(kCovResponseTimeoutMs, notification) || notification.confirmed ||
      notification.object.type != setButton.type || notification.object.instance != setButton.instance ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !hasProperty(notification, BacnetPropertyId::StatusFlags)) {
    printResult("FAIL", "COV A object initial notification");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV A object initial Present_Value + Status_Flags");
  Serial.println("[HIL] Press SET (BI2) within 20 seconds; no ReadProperty is sent.");
  if (!waitForNotification(kCovManualChangeTimeoutMs, notification) || notification.confirmed ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !hasProperty(notification, BacnetPropertyId::StatusFlags)) {
    printResult("FAIL", "COV A button notification");
    return ScenarioOutcome::Fail;
  }
  if (!client.sendSubscribeCov(target, kSetProcessId, setButton, 60, 22, false) ||
      !waitForSubscriptionResponse(false, 22) ||
      !waitForNotification(kCovResponseTimeoutMs, notification) ||
      !cancelObject(kSetProcessId, setButton, false, 23) ||
      waitForNotification(kCovCancellationQuietMs, notification)) {
    printResult("FAIL", "COV A renewal or cancellation");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV A renewal and cancellation");

  constexpr uint32_t kMidProcessId = 0xE201U;
  logSubscription("B", kMidProcessId, midButton, "object", true, 31);
  if (!client.sendSubscribeCov(target, kMidProcessId, midButton, 30, 31, true) ||
      !waitForSubscriptionResponse(false, 31) ||
      !waitForNotification(kCovResponseTimeoutMs, notification) || !notification.confirmed ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !hasProperty(notification, BacnetPropertyId::StatusFlags)) {
    printResult("FAIL", "COV B confirmed initial notification");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV B confirmed initial notification acknowledged");
  Serial.println("[HIL] Press MID (BI1) within 20 seconds; client automatically SimpleACKs COV.");
  if (!waitForNotification(kCovManualChangeTimeoutMs, notification) || !notification.confirmed ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !hasProperty(notification, BacnetPropertyId::StatusFlags) ||
      !cancelObject(kMidProcessId, midButton, true, 32)) {
    printResult("FAIL", "COV B confirmed button notification or cancellation");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV B confirmed button notification acknowledged");

  constexpr uint32_t kResetProcessId = 0xE200U;
  logSubscription("C", kResetProcessId, resetButton, "Present_Value property", false, 41);
  if (!client.sendSubscribeCovProperty(target, kResetProcessId, resetButton, BacnetPropertyId::PresentValue, 30, 41) ||
      !waitForSubscriptionResponse(true, 41) ||
      !waitForNotification(kCovResponseTimeoutMs, notification) || notification.confirmed ||
      notification.propertyCount != 1 ||
      !hasProperty(notification, BacnetPropertyId::PresentValue)) {
    printResult("FAIL", "COV C property initial notification");
    return ScenarioOutcome::Fail;
  }
  Serial.println("[HIL] Press RST (BI0) within 20 seconds; only Present_Value is subscribed.");
  if (!waitForNotification(kCovManualChangeTimeoutMs, notification) ||
      notification.propertyCount != 1 ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !cancelProperty(kResetProcessId, resetButton, BacnetPropertyId::PresentValue, 42)) {
    printResult("FAIL", "COV C property button notification or cancellation");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV C property-only notification");

