vitalyruhl/esp32-bacnet-stack/examples/hil-cov-espClient-to-espServer-acceptance/src/main.cpp
  constexpr uint32_t kLightProcessId = 0xE100U;
  logSubscription("D", kLightProcessId, lightSensor, "Present_Value property + COV_Increment", false, 51);
  if (!client.sendSubscribeCovProperty(target, kLightProcessId, lightSensor, BacnetPropertyId::PresentValue, 30, 51, false, BacnetClient::kNoArrayIndex, true, 0.5F) ||
      !waitForSubscriptionResponse(true, 51) ||
      !waitForNotification(kCovResponseTimeoutMs, notification) ||
      notification.propertyCount != 1 ||
      !hasProperty(notification, BacnetPropertyId::PresentValue)) {
    printResult("FAIL", "COV D light initial notification");
    return ScenarioOutcome::Fail;
  }
  Serial.println("[HIL] Change LDR light level by at least 0.5 percent within 20 seconds.");
  if (!waitForNotification(kCovManualChangeTimeoutMs, notification) ||
      notification.propertyCount != 1 ||
      !hasProperty(notification, BacnetPropertyId::PresentValue) ||
      !cancelProperty(kLightProcessId, lightSensor, BacnetPropertyId::PresentValue, 52)) {
    printResult("FAIL", "COV D light COV_Increment notification or cancellation");
    return ScenarioOutcome::Fail;
  }
  printResult("PASS", "COV D property COV_Increment notification");
  return ScenarioOutcome::Pass;
#endif
}

ScenarioOutcome runWritePropertyScenario() {
  printResult("I", "WriteProperty scenario enabled but no writes executed");
  return ScenarioOutcome::Fail;
}

bool priorityWriteValueEquals(const BacnetValue& left, const BacnetValue& right) {
  return bacnet_example::hil::valuesEqual(left, right);
}

void printPriorityWriteValue(const PriorityWriteTarget& target,
                             const char* stage,
                             BacnetDeviceSessionReadStatus status,
                             const BacnetValue& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(bacnetObjectTypeText(target.type));
  Serial.print(",");
  Serial.print(target.instance);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.print(bacnetReadStatusText(status));
  Serial.print(" value=");
  Serial.print(value.displayText());
  Serial.print(" type=");
  Serial.println(bacnetValueTypeName(value.type));
}

void printPriorityWritePropertyStatus(const PriorityWriteTarget& target,
                                      const char* stage,
                                      BacnetPropertyReadStatus status,
                                      const BacnetValue& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.print(bacnetPropertyReadStatusText(status));
  Serial.print(" value=");
  Serial.println(value.displayText());
}

void printPriorityWriteArrayStatus(const PriorityWriteTarget& target,
                                   const char* stage,
                                   BacnetPropertyReadStatus status,
                                   const BacnetPriorityArray& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.println(bacnetPropertyReadStatusText(status));
  if (status != BacnetPropertyReadStatus::Ack) {
    return;
  }
  for (size_t slot = 0; slot < BacnetPriorityArray::kSlotCount; ++slot) {
    Serial.print("[HIL] priority-write ");
    Serial.print(target.label);
    Serial.print(" ");
    Serial.print(stage);
    Serial.print("[");
    Serial.print(slot + 1);
    Serial.print("] value=");
    Serial.print(value.slots[slot].displayText());
    Serial.print(" present=");
    Serial.println(value.present[slot] ? "yes" : "no");
  }
}

void printPriorityWriteStatus(const PriorityWriteTarget& target,
                              const char* stage,
                              BacnetDeviceSessionWriteStatus status) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.println(bacnetWriteStatusText(status));
}

bool cleanupPriorityWrite(BacnetRemoteObject& object,
                          const PriorityWriteTarget& target,
                          bool& priorityActive) {
  if (!priorityActive) {
    return true;
  }
  const BacnetDeviceSessionWriteStatus cleanupStatus =
    object.relinquishPresentValue(kPriorityWritePriority, kScanReadTimeoutMs);
  printPriorityWriteStatus(target, "relinquish-priority-8-cleanup", cleanupStatus);
  if (cleanupStatus == BacnetDeviceSessionWriteStatus::Ack) {
    priorityActive = false;
    printResult("I", "priority cleanup acknowledged after failed scenario step");
    return true;
  }
  printResult("FAIL", "priority cleanup failed; priority override may remain active");
  return false;
}

void printPriorityWriteReset(const PriorityWriteTarget& target,
                             const char* mode,
                             const BacnetPriorityRelinquishResult& result) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" reset status=");
  Serial.print(bacnetWriteStatusText(result.status));
  Serial.print(" mode=");
  Serial.print(mode);
  Serial.print(" completed=");
  Serial.print(result.completedPriorities);
  Serial.print(" skipped-priority=");
  Serial.print(result.skippedPriority);
  Serial.print(" failed-priority=");
  Serial.println(result.failedPriority);
}

bool readPriorityWriteSlot(BacnetRemoteObject& object,
                           const PriorityWriteTarget& target,
                           uint8_t priority,
                           const char* stage,
                           BacnetValue& value) {
  const BacnetPropertyReadStatus status = object.readPriorityArray(
    value, kScanReadTimeoutMs, priority);
  printPriorityWritePropertyStatus(target, stage, status, value);
  return status == BacnetPropertyReadStatus::Ack ||
         status == BacnetPropertyReadStatus::EmptyValue;
}

bool makePriorityWriteValue(BacnetRemoteObject& object,
                            const PriorityWriteTarget& target,
                            const BacnetValue& current,
                            BacnetValue& value) {
  return bacnet_example::hil::selectTemporaryValue(
    object, target.type, current, kScanReadTimeoutMs, value);
}

bool observePriorityWriteValue(BacnetRemoteObject& object,
                               const PriorityWriteTarget& target,
                               const BacnetValue& expected,
                               const char* stage,
                               bool requireExpectedValue) {
  BacnetValue first;
  BacnetValue last;
  for (uint8_t observation = 0; observation < kPriorityWriteObservationCount;
       ++observation) {
    BacnetValue value;
    const BacnetDeviceSessionReadStatus status =
      object.readPresentValue(value, kScanReadTimeoutMs);
    printPriorityWriteValue(target, stage, status, value);
    if (status != BacnetDeviceSessionReadStatus::Ack ||
        (requireExpectedValue && !priorityWriteValueEquals(value, expected))) {
      return false;
    }
    if (observation == 0) {
      first = value;
    }
    last = value;
    if (observation + 1 < kPriorityWriteObservationCount) {
      delay(kPriorityWriteObservationDelayMs);
    }
  }
  return target.type != BacnetObjectType::AnalogValue || requireExpectedValue ||
         !priorityWriteValueEquals(first, last);
}

bool verifyPriorityWriteReset(BacnetRemoteObject& object,
                              const PriorityWriteTarget& target) {
  for (uint8_t priority = 1; priority <= 16; ++priority) {
    BacnetValue value;
    if (!readPriorityWriteSlot(object, target, priority, "priority-array-reset", value)) {
      return false;
    }
    if (priority != kMinimumOnOffPriority && priority != 16 &&
        value.type != BacnetValueType::Null) {
      return false;
    }
  }
  return true;
}

ScenarioOutcome runPriorityResetProbeScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

